Revit 2027 API
BuiltInFailures.GeneralFailures.GenericFatalError Property
 A fatal error has occurred. The application will be terminated. You will be given the opportunity to save recovery files for all of your changed projects.\tWould you like to save a recovery file for [Project Name]?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GenericFatalError { get; }
Public Shared ReadOnly Property GenericFatalError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GenericFatalError {
	FailureDefinitionId^ get ();
}
static member GenericFatalError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace